Revit 2024 API
FamilyInstance.SuperComponent Property
Property to get the super component of current family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Element SuperComponent { get; }
Visual Basic
Public ReadOnly Property SuperComponent As Element
	Get
Visual C++
public:
property Element^ SuperComponent {
	Element^ get ();
}
Remarks
When the FamilyInstance has no super component, it returns null
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace